# Напишите программу, которая принимает на вход координаты двух точек и
# находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21
import math

A = [int(input('Введите Х координату первой точки: ')), int(input('Введите Y координату первой точки: '))]
B = [int(input('Введите Х координату второй точки: ')), int(input('Введите Y координату второй точки: '))]

distance = math.sqrt(((B[0] - A[0]) ** 2) + ((B[1] - A[1]) ** 2))
print(round(distance, 2))