# Напишите программу, которая по заданному номеру четверти,
# показывает диапазон возможных координат точек в этой четверти (x и y).

a = int(input('Введите номер четверти: '))

if(a==1):
    print('x=(0, oo]; y=(0, oo]')
elif(a==2):
    print('x=(0, -oo]; y=(0, oo]')
elif (a == 3):
    print('x=(0, -oo]; y=(0, -oo]')
elif (a == 4):
    print('x=(0, oo]; y=(0, -oo]')